IdeaRS.Connections
CutOrientation Enumeration
Compatible with IDEA StatiCa 0.0
 Represents the type of the cut
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum CutOrientation
Members
Member name | Value | Description
Parallel | 1 |  The cut is in parallel with cutting plane
Perpendicular | 2 |  The cut is perpendicular to cutting plane
See Also
Reference
IdeaRS.Connections.Data Namespace